Revit 2027 API
ParameterTypeId.AnalyticalModelTopAlignmentMethod Property
 "Top Alignment Method"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelTopAlignmentMethod { get; }
Public Shared ReadOnly Property AnalyticalModelTopAlignmentMethod As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelTopAlignmentMethod {
	ForgeTypeId^ get ();
}
static member AnalyticalModelTopAlignmentMethod : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace